app/views/groups/availability.html.erb

SELECT "subjects"."id" FROM "subjects"  WHERE "subjects"."subject_category_id" = 10
---
              <br>
              <% @tmp_array_of_subjects = Array.new(Subject.where(:subject_category_id => scat.id).select(:id).each{|el| el.object_id }) %>

SELECT "group_languages".* FROM "group_languages"  WHERE "group_languages"."id" IN (1)
---

              <% @irdenki_toparlar = @bu_ders_gornusi_toparlar.where(:lesson_time_id => @lessonTimes[0].id).includes(:group_language).order(:groupTitle) %>