app/controllers/groups_controller.rb

SELECT  "seasons".* FROM "seasons"  WHERE "seasons"."id" = 12 LIMIT 1
SELECT "subject_categories".* FROM "subject_categories"  WHERE ("subject_categories"."subjectCategoryFullName" != 'Türkçe')  ORDER BY "subject_categories"."subjectCategoryFullName" ASC
SELECT "lesson_times".* FROM "lesson_times"   ORDER BY "lesson_times"."lessonTimeFrom" ASC
---
  def availability
    @current_season_id = session[:active_season_id]
    @current_season = Season.find_by_id(@current_season_id)

    #if (@current_season_groups.nil?)
    #@current_season_groups = @current_season.cached_current_season_open_groups
    @current_season_groups = Group.where(:season_id =>@current_season_id, :isClosed => false)
    #end


    @current_season_contracts = Contract.where(:isMoneyReturned => false, :season_id => @current_season_id)
    #@current_season_contracts = @current_season.cached_current_season_active_contracts

    #@current_season_timetables = @current_season.cached_current_season_timetables
    @current_season_timetables = Timetable.where(:group_id => @current_season_groups.select(:id))

    @subject_categories = SubjectCategory.all.order(:subjectCategoryFullName)
    @lessonTimes = LessonTime.all.order(:lessonTimeFrom)